"""Информация обо мне для наполнения шаблонов."""

INFO = (
    "Кобзев Иван Алексеевич",
    "28 сентября 2000 года (Весы)",
    "г. Москва",
    "Высшее (специалитет)",
)

TEXT_ABOUT_ME = (
    "<b>О разработчике</b>\n\n"
    f"<b>ФИО:</b> {INFO[0]}\n"
    f"<b>Дата рождения:</b> {INFO[1]}\n"
    f"<b>Место рождения:</b> {INFO[2]}\n"
    f"<b>Уровень образования:</b> {INFO[3]}\n\n"
    "Junior backend-разработчик с энтузиазмом к созданию"
    "качественного кода и обучению новым технологиям. "
    "Имею опыт в разработке на языке Python"
    " и знаком с популярными фреймворками,"
    " такими как Aiogram для создания"
    " ботов и Django для веб-разработки. "
    "Стремлюсь к постоянному совершенствованию"
    " своих навыков и решению реальных задач с использованием современных"
    " инструментов разработки.\n\n"
    "Мой путь в программировании только начинается, но я уже успел"
    " поработать с различными проектами, которые помогли мне освоить"
    " основы разработки и повысить уровень знаний. Я открыт к новым"
    " вызовам и всегда готов учиться, чтобы развиваться как специалист"
    " в области технологий."
)

SOFT_SKILLS_LIST = (
    "<b>Софт-скиллы</b>\n\n"
    "<b>Командная работа и коммуникабельность</b>\n"
    "Легко нахожу общий язык с коллегами и людьми, "
    "умею работать в команде.\n\n"
    "<b>Ответственность</b>\n"
    "Знаю ценность своей работы и цену ее результатов.\n\n"
    "<b>Внимательность</b>\n"
    "Стремлюсь к качеству и точности продукта, изучаю требования"
    " и спецификации.\n\n"
    "<b>Адаптивность</b>\n"
    "Быстро осваиваю новые инструменты и технологии.\n\n"
    "<b>Навыки критического мышления</b>\n"
    "Умею анализировать проблемы, находить оптимальные решения "
    "и обосновывать их.\n\n"
    "<b>Эмоциональный интеллект</b>\n"
    "Способен понимать эмоции людей, реагировать на них с уважением "
    "и учитывать их, как в жизни, так и в работе.\n\n"
    "<b>Гибкость</b>\n"
    "Легко приспосабливаюсь к изменениям, не боюсь пробовать новое.\n\n"
    "<b>Решение конфликтов</b>\n"
    "Нахожу пути для урегулирования разногласий, добиваюсь "
    "конструктивного взаимодействия."
)

HARD_SKILLS_LIST = (
    "<b>Хард-скиллы</b>\n\n"
    "<b>Языки программирования:</b>\n"
    "- Python\n\n"
    "<b>Языки разметки и форматирования:</b>\n"
    "- HTML\n- CSS\n\n"
    "<b>Фреймворки:</b>\n"
    "- Django\n- Aiogram\n- Requests\n\n"
    "<b>Базы данных:</b>\n"
    "- SQL (PostgreSQL)\n- ORM (SQLAlchemy, SQLite)\n\n"
    "<b>API и веб-сервисы:</b>\n"
    "- <i>В процессе изучения...</i>\n\n"
    "<b>Тестирование:</b>\n"
    "- PyTest, Unittest\n\n"
    "<b>Системы контроля версий:</b>\n"
    "- Git (GitHub)\n\n"
    "<b>Контейнеризация и DevOps:</b>\n"
    "- Docker (<i>В процессе изучения...</i>)\n"
    "- CI/CD (<i>В процессе изучения...</i>)\n\n"
    "<b>Безопасность:</b>\n"
    "- Основы безопасности приложений, шифрование данных "
    "и защита от SQL-инъекций, XSS, CSRF."
)
